### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "AllowedDeveloperUsers"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AllowedDeveloperUsers)"
          + "AndroidBundleIdentifiers"                                  = "it.pagopa.io.app,it.pagopa.app.io.poc.itwallet,UnknownPackage"
          + "AndroidCrlUrls"                                            = "https://android.googleapis.com/attestation/status"
          + "AndroidPlayIntegrityUrl"                                   = "https://www.googleapis.com/auth/playintegrity"
          + "AndroidPlayStoreCertificateHash"                           = "feT-Pqrgg__NiwcDAehlAtPx6tHdZqwUK618VEdVT4I"
          + "AppInsightsConnectionString"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AppInsightsConnectionString)"
          + "AppleRootCertificate"                                      = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUNJVENDQWFlZ0F3SUJBZ0lRQy9PK0R2SE4wdUQ3akc1eUgySVhtREFLQmdncWhrak9QUVFEQXpCU01TWXdKQVlEVlFRRERCMUJjSEJzWlNCQmNIQWdRWFIwWlhOMFlYUnBiMjRnVW05dmRDQkRRVEVUTUJFR0ExVUVDZ3dLUVhCd2JHVWdTVzVqTGpFVE1CRUdBMVVFQ0F3S1EyRnNhV1p2Y201cFlUQWVGdzB5TURBek1UZ3hPRE15TlROYUZ3MDBOVEF6TVRVd01EQXdNREJhTUZJeEpqQWtCZ05WQkFNTUhVRndjR3hsSUVGd2NDQkJkSFJsYzNSaGRHbHZiaUJTYjI5MElFTkJNUk13RVFZRFZRUUtEQXBCY0hCc1pTQkpibU11TVJNd0VRWURWUVFJREFwRFlXeHBabTl5Ym1saE1IWXdFQVlIS29aSXpqMENBUVlGSzRFRUFDSURZZ0FFUlRIaG1MVzA3QVRhRlFJRVZ3VHRUNGR5Y3RkaE5iSmhGcy9JaTJGZENnQUhHYnBwaFkzK2Q4cWp1RG5nSU4zV1ZoUVVCSEFvTWVRL2NMaVAxc09VdGdqcUs5YXVZZW4xbU1FdlJxOVNrM0ptNVg4VTYySCt4VEQzRkU5VGdTNDFvMEl3UURBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTc2tSQlRNNzIrYUVIL3B3eXA1ZnJxNWVXS29UQU9CZ05WSFE4QkFmOEVCQU1DQVFZd0NnWUlLb1pJemowRUF3TURhQUF3WlFJd1FnRkduQnl2c2lWYnBUS3dTZ2Ewa1AwZThFZURTNCtzUW1UdmI3dm41M081K0ZSWGdlTGhwSjA2eXNDNVByT3lBakVBcDVVNHhEZ0VnbGxGN0VuM1ZjRTNpZXhaWnRLZVlucHF0aWpWb3lGcmFXVkl5ZC9kZ2FubXJkdUMxYm1UQkd3RAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0t"
          + "AuthProfileApiBaseURL"                                     = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          + "AuthProfileApiKey"                                         = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AuthProfileApiKey)"
          + "AzureWebJobs.addWalletInstanceToValidationQueue.Disabled"  = "0"
          + "AzureWebJobs.generateEntityConfiguration.Disabled"         = "0"
          + "AzureWebJobs.sendEmailOnWalletInstanceCreation.Disabled"   = "0"
          + "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled" = "0"
          + "AzureWebJobs.validateWalletInstance.Disabled"              = "0"
          + "CosmosDbDatabaseName"                                      = "db"
          + "CosmosDbEndpoint__accountEndpoint"                         = "https://io-p-itn-wallet-cosno-02.documents.azure.com:443/"
          + "CosmosDbRequestTimeout"                                    = "5000"
          + "EntityConfigurationAuthorityHints"                         = "https://ta.wallet.ipzs.it"
          + "EntityConfigurationStorageAccountName"                     = "iopitnwalletcdnst01"
          + "EntityConfigurationStorageContainerName"                   = "well-known"
          + "FETCH_KEEPALIVE_ENABLED"                                   = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                       = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                          = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                               = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                         = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                                   = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                            = "2"
          + "FUNCTIONS_WORKER_RUNTIME"                                  = "node"
          + "FederationEntityBasePath"                                  = "https://wallet.io.pagopa.it"
          + "FederationEntityContacts"                                  = "pagopaspa@pec.pagopa.it"
          + "FederationEntityHomepageUri"                               = "https://io.italia.it"
          + "FederationEntityLogoUri"                                   = "https://io.italia.it/assets/img/io-it-logo-blue.svg"
          + "FederationEntityOrganizationName"                          = "PagoPA S.p.A."
          + "FederationEntityPolicyUri"                                 = "https://io.italia.it/privacy-policy/"
          + "FederationEntityTosUri"                                    = "https://io.italia.it/privacy-policy/"
          + "GoogleAppCredentialsEncoded"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=GoogleAppCredentialsEncoded)"
          + "GooglePublicKey"                                           = "LS0tLS1CRUdJTiBQVUJMSUMgS0VZLS0tLS0KTUlJQ0lqQU5CZ2txaGtpRzl3MEJBUUVGQUFPQ0FnOEFNSUlDQ2dLQ0FnRUFyN2JIZ2l1eHB3SHNLN1F1aTh4VQpGbU9yNzVndk1zZC9kVEVEREpkU1N4dGY2QW43eHlxcFJSOTBQTDJhYnhNMWRFcWxYbmYydHF3MU5lNFh3bDVqCmxSZmRuSkxtTjBwVHkvNGxqNC83dHYwU2szaWlLa3lwbkVVdFI2V2ZNZ0gwUVpmS0hNMStkaSt5OVRGUnR2NnkKLy8wcmIrVCtXOGE5bnNOTC9nZ2puYXI4NjQ2MXFPMHJPczJjWGpwM2tPRzFGRUo1TVZtRm1CR3RucktwYTczWApwWHlUcVJ4Qi9NMG4xbi9XOW5HcUM0RlNZYTA0VDZONVJJWkdCTjJ6Mk1UNUlLR2JGbGJDOFVyVzBEeFc3QVlJCm1RUWNIdEdsL20wMFFMVld1dEhRb1ZKWW5GUGxYVGNIWXZBU0x1K1JoaHNiRG14TWdKSjBtY0RwdnNDNFBqdkIKK1R4eXdFbGdTNzB2RTBYbUxEK09KdHZzQnNsSFp2UEJLQ09kVDBNUyt0Z1NPSWZnYSt6MVoxZzcrRFZhZ2Y3cQp1dm1hZzhqZlBpb3lLdnhuSy9FZ3NUVVZpMmdoenE4d20yN3VkL21JTTdBWTJxRU9SUjhHbzNUVkI0SHpXUWdwClpydDNpNU1JbENhWTUwNEx6U1JpaWdIQ3pBUGxId3MrVzByQjVOK2VyNS8ycEpLbmZCU0RpQ2lGQVZ0Q0xPWjcKZ0xpTW0wamhPMkI2dFVYSEkvK01SUGp5MDJpNTlsSU5NUlJldjU2R0t0Y2Q5cU8vMGtVSldkWlRkQTJYb1M4MgppeFB2WnRYUXBVcHVMMTJhYis5RWFESzhaNFJISllZZkNUM1E1dk5BWGFpV1ErOFBUV20yUWdCUi9ia3dTV2MrCk5wVUZnTlBOOVB2UWk4V0VnNVVtQUdNQ0F3RUFBUT09Ci0tLS0tRU5EIFBVQkxJQyBLRVktLS0tLQ=="
          + "HardwarePublicTestKey"                                     = "LS0tLS1CRUdJTiBQVUJMSUMgS0VZLS0tLS0KTUZrd0V3WUhLb1pJemowQ0FRWUlLb1pJemowREFRY0RRZ0FFMDFtMHhmNXVqUTVnMjJGdloyemJGcnZ5THg5YgpnTjJBaUxWRnRjYTJCVUh0a2dwV3Y5WUpDRElzNmxQS3hWU3NFb25QVXZPTTJVcmNNUGdwMDRZZU9nPT0KLS0tLS1FTkQgUFVCTElDIEtFWS0tLS0t"
          + "HttpRequestTimeout"                                        = "5000"
          + "IosBundleIdentifiers"                                      = "it.pagopa.app.io,it.pagopa.app.io.poc.itwallet"
          + "IosTeamIdentifier"                                         = "M2X5YQ4BJ7"
          + "MailSender"                                                = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MailupSecret"                                              = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=MailupSecret)"
          + "MailupUsername"                                            = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=MailupUsername)"
          + "NODE_ENV"                                                  = "production"
          + "PidIssuerApiBaseURL"                                       = "https://util.wallet.ipzs.it"
          + "PidIssuerApiClientCertificate"                             = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4RENDQWRpZ0F3SUJBZ0lVRnhWVkZnNFYzOTA3VWY0ZHVXZExURWFIQTVJd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0R6RU5NQXNHQTFVRUF3d0VjbTl2ZERBZUZ3MHlOREEzTWpNeE1EQTBNREphRncwek5EQTNNakV4TURBMApNREphTUJFeER6QU5CZ05WQkFNTUJtTnNhV1Z1ZERDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDCkFRb0NnZ0VCQUxsUHd2TTBxbTVvNGpoVHQ4cGRxYkhTR1pPbmpoejJSZG1iaVpkbmZqdm5UbCtwcVcwY1BRNHcKVk0xQkQrYllDKzVjbTVNRmRkNkt3SWM1SjBaRzJTcy9adEZpRTJKMnEvM084VDlkY0tQNHRBY0ZMcnVaTEtRbQpWZk5vZng4ZzN1cktBL01lTUhxZTR3U1RQU25iUGNPd0tYMmdsQlE2bU0vODdUdHdvd2RrWE9La1RkRGRDZlZMCjNyODhEVGNYR0ZDM2VsZlU1bSs4ZlUvVFVKMzMzMkR2MjNqRGY2ZEVPaUEwaDRBNTZob3FNLzlYQkU0OVZBNjMKakMzdlRKL0pObGFDMnlRYSs5Zno3TFRMV09WUFdNdFFhTm1XNGN4TnVJM01WZi8rWkFnOFNibWVkUG5rRjV5RApJeWlmM0pVb3F2elJjQ2JMaFg4Z0t5UU02UUxKVWI4Q0F3RUFBYU5DTUVBd0hRWURWUjBPQkJZRUZPZTJWTUE5Cll2eDBIWDYvdE1xeUkxNysxS05ZTUI4R0ExVWRJd1FZTUJhQUZGZFFmeGRsUUsvTEhzMjE4V2txQmp0c1daSWYKTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFBb1lZL2tsQW1OVDA5TFZVU0JhZ3Fla0hwVnhJMjZCSVZUUHRuagpKdExsTXd0RHgxZHA5VGNXN3A4ZHFNaVVyWm4vVm10Vm9IUU95c3IrQlNuNHRqTG1taGtJQ2Zacm05SXQxTVA5ClIzWUdOVS96dzZSTlVpSGVCRnY2Snk0emI3dk1Nck1TM2h3eXdaMk0xaUlhZVdHeitFOHdNSDk1UVkxQU8rZjYKaERNa3p1dkJIVDhOQ1lRTTNOSlFNWFh1Nkx5VHBBQU93a3VlNHhmMjBmSXpYc1g1VGFTYXJZOXZ2VHJueW43awpBRkNQREkycTZ6MUNPcHNOcVlNMld2c014Y1ZNRU4zZEFZYWVMUlAzODNyVk9Ua1pnckN0SVlPYlVUNzVTSi81CkxMOVd1Zm1XY2xMY1BLR3UzRTBaZnIxM1daR1E5eW5EaEIwb01wUnpOdWFmN2hJMAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + "PidIssuerApiClientPrivateKey"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=PidIssuerApiClientPrivateKey)"
          + "PidIssuerApiRequestTimeout"                                = "10000"
          + "PidIssuerApiRootCACertificate"                             = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUhkVENDQlYyZ0F3SUJBZ0lRWERzL042MzhLUDRQejlPcitEK0ZVVEFOQmdrcWhraUc5dzBCQVFzRkFEQnIKTVFzd0NRWURWUVFHRXdKSlZERU9NQXdHQTFVRUJ3d0ZUV2xzWVc0eEl6QWhCZ05WQkFvTUdrRmpkR0ZzYVhNZwpVeTV3TGtFdUx6QXpNelU0TlRJd09UWTNNU2N3SlFZRFZRUUREQjVCWTNSaGJHbHpJRUYxZEdobGJuUnBZMkYwCmFXOXVJRkp2YjNRZ1EwRXdIaGNOTWpBd056QTJNRGN5TURVMVdoY05NekF3T1RJeU1URXlNakF5V2pDQmlURUwKTUFrR0ExVUVCaE1DU1ZReEVEQU9CZ05WQkFnTUIwSmxjbWRoYlc4eEdUQVhCZ05WQkFjTUVGQnZiblJsSUZOaApiaUJRYVdWMGNtOHhGekFWQmdOVkJBb01Ea0ZqZEdGc2FYTWdVeTV3TGtFdU1UUXdNZ1lEVlFRRERDdEJZM1JoCmJHbHpJRTl5WjJGdWFYcGhkR2x2YmlCV1lXeHBaR0YwWldRZ1UyVnlkbVZ5SUVOQklFY3pNSUlDSWpBTkJna3EKaGtpRzl3MEJBUUVGQUFPQ0FnOEFNSUlDQ2dLQ0FnRUFzNzNDaCt0Mm93bTNheVRreXF5ME9QdUNUaXlieFR5Uwo0Y1U0eTB0MlJHU3dDTmpMaC9yY3V0TzB5b3JpWnhWdFByTk1jSVJRNTQ0QlFoSEZ0L3lwVzdlK3Q4d1dLckhhCnIzQmtLd1NVYnFOd3BEV1AxYlhzN0lKVFZoSFhXR0FtN0FrMUZocnJCbXRYazhRdGR6VHpERHV4ZkZCSzdzQ0wKTjBKZHFvcWIxVjF6M3dzV3FBdnI0S2xTQ0ZXMDVOaDRiYVdtL2tYT21iOFUrWFI2a1VtdW9WdmlhM2lCaG90UgpUekFIVE85U1dXa2dqVGNpci9uaEJ2eUwyUm9xa2dZeVAvazUwYnpuYVZPR0ZuRld6ZmwwWG5yTS9zYWxmQ0JoCk8wLzF2TmFvVThlbFI2QXRiZENGQXVwZ1F5OTVHdUZJUlZTOG4vY0YwUXVwZlBqVWwra0dTTHp2R0FjKzZvTkUKYWxwQWhLSVMvK1AwdU9EelJyUzlFcTBXWDFpU2o2S0h0UU1OTjRaS3NTNG5zdXZZQ2FobkFjMFF3UXlvZHVBVwppVS95bmhVOVdUSUVlMVZJb0VERTc5TlBPSTIvODBScWJacWRwQUtVYWYwRnZ1cVZYaEVjamlKSnUrZDB3OVlOCmI3Z3VyZDZ4a2FTWGVtVy9mUDRpZEJpTmtkOGFDVkFkc2hHUVluNnloK25hMEx1NUlHODhaMmtTSUZjWER0d3kKempjeGtXODZwd2tPNkdla0VvbVZCTktjdjBDZXkyU21mOHVocFprMTVUU0NleUZEclpCV0g5T3NEc3QvVG5oegpwTjE1Nkh1dzNNM1JSZEVlZ3QzM2ZjeVB5a2d0MEhUaHhyRXY5RHdPemhzNmxDUTVSTlFKTzdadlpGMVppcWdUCkZPSjZ2czF4TXFFQ0F3RUFBYU9DQWZRd2dnSHdNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdId1lEVlIwakJCZ3cKRm9BVVV0aUlPc2lmZUdidGlmTjdPSENVeVFJQ050QXdRUVlJS3dZQkJRVUhBUUVFTlRBek1ERUdDQ3NHQVFVRgpCekFCaGlWb2RIUndPaTh2YjJOemNEQTFMbUZqZEdGc2FYTXVhWFF2VmtFdlFWVlVTQzFTVDA5VU1FVUdBMVVkCklBUStNRHd3T2dZRVZSMGdBREF5TURBR0NDc0dBUVVGQndJQkZpUm9kSFJ3Y3pvdkwzZDNkeTVoWTNSaGJHbHoKTG1sMEwyRnlaV0V0Wkc5M2JteHZZV1F3SFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdJR0NDc0dBUVVGQndNQgpNSUhqQmdOVkhSOEVnZHN3Z2Rnd2daYWdnWk9nZ1pDR2dZMXNaR0Z3T2k4dmJHUmhjREExTG1GamRHRnNhWE11CmFYUXZZMjRsTTJSQlkzUmhiR2x6SlRJd1FYVjBhR1Z1ZEdsallYUnBiMjRsTWpCU2IyOTBKVEl3UTBFc2J5VXoKWkVGamRHRnNhWE1sTWpCVExuQXVRUzRsTW1Zd016TTFPRFV5TURrMk55eGpKVE5rU1ZRL1kyVnlkR2xtYVdOaApkR1ZTWlhadlkyRjBhVzl1VEdsemREdGlhVzVoY25rd1BhQTdvRG1HTjJoMGRIQTZMeTlqY213d05TNWhZM1JoCmJHbHpMbWwwTDFKbGNHOXphWFJ2Y25rdlFWVlVTQzFTVDA5VUwyZGxkRXhoYzNSRFVrd3dIUVlEVlIwT0JCWUUKRkorS3NiWHhzZDZDOUNkOHZvak4zcWxEZ2FOTE1BNEdBMVVkRHdFQi93UUVBd0lCQmpBTkJna3Foa2lHOXcwQgpBUXNGQUFPQ0FnRUFKYnlnTW5LSjVNNmJ5cjVFY3RxMDVPRHF3Tk10a3k4VEVGM081NWc2UkhoeGJsZjZPZWdaCjR1aTQrRWxITk9JWGp5Y2JldVVHdUZBNExTY0NDOWZuSTFSbm44VEkyUTdPUDVZV2lmRWZucmRwOTl0L3RKelEKaGZkaTdaVGRSUlpaR1Y5eCtncmZSL1J0alQyQzNMdDlYNGxjYnVTeFRlYTNQSEF3d2kwQTNiWVJSMUw1Y2lQbQplQW5ZdEc5a3BhdDgvUnVDMjJveGlaWjVGZGpVNndyUldrQVNSTGlJd05jRklZZnZwVWJNV0VsYUNVaHFhQjJ5Cll2V0Y4bzAycG5hWWI0YnZUQ2c0Y1ZhYlZub2pVdXVYSDgxTGVRaGhzU1hMd2Nkd1NkZXcwTkw0ekNpTkNuMlEKaURacHoyYmlDV0RnZ2libVd4c1VVRjZBYnFNSG53c2RTOHZzS1hpRlFKSGVBZE5BaEEra3dwcVlBZGhVaUNkagpSVFVkdFJOVXVjTHZaRU4xT0F2Vll5b2c5eFlDZmh0a3FnWFFST01BTlArWi8reWFaYWhhUC9WZ2FrL1YwMHNlCkhkaDdGK0I2aDVIVmR3ZGgrMTdFMmpsK2FNVGZ5dkJGY2cySC85UWp5bDRUWThOVy82djBEUEs1MnNWdDhhMzUKSSs3eExHTFBvaEFsNHo2cEVmMk94Z2pNTmZYWENYUzMzc21SZ3oxZExRRm84VXBBYjNyZjg0emtYYXFFSTZRaQoyUCs1cGliVkZRaWdSYm40UmNFK0syYS9ubTJNL28rV1pUU2lvK0UrWVhhY25OazcxVmNPODJiaU9vZitqQktUCmlDM1hpN3JBbHlwbW1lK1FGQnc5RjFKODlpZzNzbVYvSGFOOHRPMGxmVHB2bTdadnpkNVRrTXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0KLS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZ1ekNDQTZPZ0F3SUJBZ0lJVndvUmwwTEU0OHd3RFFZSktvWklodmNOQVFFTEJRQXdhekVMTUFrR0ExVUUKQmhNQ1NWUXhEakFNQmdOVkJBY01CVTFwYkdGdU1TTXdJUVlEVlFRS0RCcEJZM1JoYkdseklGTXVjQzVCTGk4dwpNek0xT0RVeU1EazJOekVuTUNVR0ExVUVBd3dlUVdOMFlXeHBjeUJCZFhSb1pXNTBhV05oZEdsdmJpQlNiMjkwCklFTkJNQjRYRFRFeE1Ea3lNakV4TWpJd01sb1hEVE13TURreU1qRXhNakl3TWxvd2F6RUxNQWtHQTFVRUJoTUMKU1ZReERqQU1CZ05WQkFjTUJVMXBiR0Z1TVNNd0lRWURWUVFLREJwQlkzUmhiR2x6SUZNdWNDNUJMaTh3TXpNMQpPRFV5TURrMk56RW5NQ1VHQTFVRUF3d2VRV04wWVd4cGN5QkJkWFJvWlc1MGFXTmhkR2x2YmlCU2IyOTBJRU5CCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBcDhiRXBTbWtMTy9sR01Xd1VLTnYKVVR1ZkNsckp3a2c0Q3NJY29CaC9rYldIdVVBLzNSMW9Id2lEMVMwZWlLRDRqMWFQYlprQ2twQVcxVjhJYkluWAo0YXk4SU1LeDRJTlJpbWxOQUpaYWJ5L0FSSDZqRHVTUnpWanUzUHZISGtWSDNTZTVDQUdmcGlFZDlVRXRMMHo5CktLM2dpcTBpdEZabGpvWlVqNU5ES2Q0NVJuaWpNQ082emZCOUUxZkFYZEtEYTBoTXhLdWZnRnBiT3IzSnB5SS8KZ0Njeld3NjNpZ3hkQnpjSXkyelNla2NpUkRYRnpNd3VqdDBxN2JkOVpnMWZZVkVpVlJ2alJ1UGpQZEExWXByYgpyeFRJVzZITWlSdmhNQ2I4b0pzZmdhZEhId1Ryb3ptU0JwK1owNy9UNms5UW5Cbitsb2NlUEdYMm94Z2tnNFlRCjUxUStxRHAySkUrQkljWGpEd0w0azVSSElMdisxQTdUYUxuZHhIcUVndU5UVkhuZDI1elM4Z2ViTHJhOFB1MkYKYmU4bEVmS1hHa0poOTBxWDZJdXhFQWY2WllHeW9qblA5enovR1B2RzhWcUxXZUlDckh1UzBFNFVUMWxGOWd4ZQpLRit3NkQ5Rno4K3ZtMi83aE5OM1dwVnZySlNFbnU2OHdFcVBTcFA0UkNIaU1VVmhVRTRRMk9NMWZFd1p0TjRGCnY2TUduOGkxemVRZjF4Y0dEWHFWZEZVTmFCcjhFQnRpWkoxdDRKV2d3NVFIVncwVTVyMEYrN2lmNXQrTDRzYm4KZnBiMlU4V0FORkFvV1BBU1VIRVhNTHJtZUdPODlMS3RteXV5L3VFNWpGNjZDeUNVM251RHVQL2pWbzIzRWVrNwpqUEt4d1YyZHBBdE1LOW15R1BXMW4wc0NBd0VBQWFOak1HRXdIUVlEVlIwT0JCWUVGRkxZaURySW4zaG03WW56CmV6aHdsTWtDQWpiUU1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0h3WURWUjBqQkJnd0ZvQVVVdGlJT3NpZmVHYnQKaWZON09IQ1V5UUlDTnRBd0RnWURWUjBQQVFIL0JBUURBZ0VHTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElDQVFBTAplM0tId0dDbVNVeUlXT1lkaVBjVVpFaW0yRmdLRGs4VE5kODFIZFR0QmpISWdUNXExZDA3R2pMdWtEMFIwaTcwCmpzTmpMaU5tc0dlK2I3YkFFemxncXFJMEpaTjFVdDZubmEwT2g0bFNjV29XUEJrZGcvaWFLV1crOUQrYTJmRHoKV29jaGNZQk55K0E0bXorNyt1QXdUYytHMDJVUUdSalJsd0t4SzNKQ2FLeWd2VTVhMmhpL2E1aUIwUDJhdmw0VgpTTTBSRmJuQUtWeTA2SWozUGphdXQyTDlIbUxlY0hnUUhFaGIycnlrT0xwbjdWVStYbGZmMUFOQVRJR2swazlqCnB3bENDUlQ4QUtuQ2dITlBMc0JBMlJGN1NPcDZBc0RUNnlnQkpsaDB3Y0J6SW0yVGxmMDVmYnNxNC9hQzR5eVgKWDA0ZmtaVDYvaXlqMkhZYXVFMnlPRStiK2gxSVlIa200dlA5cWRDYTZIQ1BTWHJXNWIwS0R0c3Q4NDIvNitPawpmY3ZIbFhIbzJxTjh4Y0w0ZEpJRUc0YXNwQ0pUUUxhcy9reDJ6L3VVTXNBMW4zWS9idVdRYnFDbUpxSzRMTDdSCks0WDlwMmpJdWdFcnNXeDBIYmh6bGVmdXQ4Y2w4QUJNQUxKK3RndUxIUFBBVUo0bHVlQUkzalptL3plbDBidFUKWkN6Sko3VkxrbjVsLzlNdDRibE92SCtrUVNHUVFYZW1PUi9xbnVPZjBHWnZCZXlxZG42L2F4YWc2N1hIL0pKVQpMeXNSSnlVM2VFeFJhckR6ekZoZEZQRnFTQlgvd2dlMnNZMFBqbHhRUnJNOXZ3R1lUN0paVkVjK05IdDRiVmFUCkxuUHFaaWg0elIwVXY2Q1BMeTY0TG83eUZJck02YlY4KzJ5ZERLWGhsZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + "PidIssuerHealthCheckEnabled"                               = "false"
          + "SLOT_TASK_HUBNAME"                                         = "ProductionTaskHub"
          + "SlackStatusChannelWebhook"                                 = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=SlackStatusChannelWebhook)"
          + "StorageConnectionString"                                   = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=StorageConnectionString)"
          + "TrialSystemApiKey"                                         = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=TrialSystemApiKey)"
          + "ValidateWalletInstanceCertificatesQueueName"               = "wallet-instances-revocation-check-02"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"           = "1"
          + "WEBSITE_DNS_SERVER"                                        = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                                  = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                             = "/api/v1/wallet/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                         = "200"
          + "WEBSITE_WARMUP_PATH"                                       = "/api/v1/wallet/health"
          + "WalletAttestationWalletLink"                               = "https://wallet.io.pagopa.it"
          + "WalletAttestationWalletName"                               = "IT Wallet"
          + "WalletInstanceCreationEmailQueueName"                      = "wallet-instance-creation-email-queue-01"
          + "WalletInstanceRevocationEmailQueueName"                    = "wallet-instance-revocation-email-queue-01"
          + "WalletKeys"                                                = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletKeys)"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-wallet-pre-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-wallet-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnwalletprestfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/wallet/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureWebJobs.addWalletInstanceToValidationQueue.Disabled",
              + "AzureWebJobs.validateWalletInstance.Disabled",
              + "AzureWebJobs.generateEntityConfiguration.Disabled",
              + "AzureWebJobs.sendEmailOnWalletInstanceCreation.Disabled",
              + "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_linux_function_app_slot.this[0] will be created
  + resource "azurerm_linux_function_app_slot" "this" {
      + app_settings                                   = {
          + "AllowedDeveloperUsers"                                     = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AllowedDeveloperUsers)"
          + "AndroidBundleIdentifiers"                                  = "it.pagopa.io.app,it.pagopa.app.io.poc.itwallet,UnknownPackage"
          + "AndroidCrlUrls"                                            = "https://android.googleapis.com/attestation/status"
          + "AndroidPlayIntegrityUrl"                                   = "https://www.googleapis.com/auth/playintegrity"
          + "AndroidPlayStoreCertificateHash"                           = "feT-Pqrgg__NiwcDAehlAtPx6tHdZqwUK618VEdVT4I"
          + "AppInsightsConnectionString"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AppInsightsConnectionString)"
          + "AppleRootCertificate"                                      = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUNJVENDQWFlZ0F3SUJBZ0lRQy9PK0R2SE4wdUQ3akc1eUgySVhtREFLQmdncWhrak9QUVFEQXpCU01TWXdKQVlEVlFRRERCMUJjSEJzWlNCQmNIQWdRWFIwWlhOMFlYUnBiMjRnVW05dmRDQkRRVEVUTUJFR0ExVUVDZ3dLUVhCd2JHVWdTVzVqTGpFVE1CRUdBMVVFQ0F3S1EyRnNhV1p2Y201cFlUQWVGdzB5TURBek1UZ3hPRE15TlROYUZ3MDBOVEF6TVRVd01EQXdNREJhTUZJeEpqQWtCZ05WQkFNTUhVRndjR3hsSUVGd2NDQkJkSFJsYzNSaGRHbHZiaUJTYjI5MElFTkJNUk13RVFZRFZRUUtEQXBCY0hCc1pTQkpibU11TVJNd0VRWURWUVFJREFwRFlXeHBabTl5Ym1saE1IWXdFQVlIS29aSXpqMENBUVlGSzRFRUFDSURZZ0FFUlRIaG1MVzA3QVRhRlFJRVZ3VHRUNGR5Y3RkaE5iSmhGcy9JaTJGZENnQUhHYnBwaFkzK2Q4cWp1RG5nSU4zV1ZoUVVCSEFvTWVRL2NMaVAxc09VdGdqcUs5YXVZZW4xbU1FdlJxOVNrM0ptNVg4VTYySCt4VEQzRkU5VGdTNDFvMEl3UURBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTc2tSQlRNNzIrYUVIL3B3eXA1ZnJxNWVXS29UQU9CZ05WSFE4QkFmOEVCQU1DQVFZd0NnWUlLb1pJemowRUF3TURhQUF3WlFJd1FnRkduQnl2c2lWYnBUS3dTZ2Ewa1AwZThFZURTNCtzUW1UdmI3dm41M081K0ZSWGdlTGhwSjA2eXNDNVByT3lBakVBcDVVNHhEZ0VnbGxGN0VuM1ZjRTNpZXhaWnRLZVlucHF0aWpWb3lGcmFXVkl5ZC9kZ2FubXJkdUMxYm1UQkd3RAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0t"
          + "AuthProfileApiBaseURL"                                     = "https://io-p-itn-auth-profile-func-02.azurewebsites.net"
          + "AuthProfileApiKey"                                         = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=AuthProfileApiKey)"
          + "AzureFunctionsWebHost__hostid"                             = "staging"
          + "AzureWebJobs.addWalletInstanceToValidationQueue.Disabled"  = "1"
          + "AzureWebJobs.generateEntityConfiguration.Disabled"         = "1"
          + "AzureWebJobs.sendEmailOnWalletInstanceCreation.Disabled"   = "1"
          + "AzureWebJobs.sendEmailOnWalletInstanceRevocation.Disabled" = "1"
          + "AzureWebJobs.validateWalletInstance.Disabled"              = "1"
          + "CosmosDbDatabaseName"                                      = "db"
          + "CosmosDbEndpoint__accountEndpoint"                         = "https://io-p-itn-wallet-cosno-02.documents.azure.com:443/"
          + "CosmosDbRequestTimeout"                                    = "5000"
          + "EntityConfigurationAuthorityHints"                         = "https://ta.wallet.ipzs.it"
          + "EntityConfigurationStorageAccountName"                     = "iopitnwalletcdnst01"
          + "EntityConfigurationStorageContainerName"                   = "well-known"
          + "FETCH_KEEPALIVE_ENABLED"                                   = "true"
          + "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                       = "30000"
          + "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                          = "10"
          + "FETCH_KEEPALIVE_MAX_SOCKETS"                               = "40"
          + "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                         = "110000"
          + "FETCH_KEEPALIVE_TIMEOUT"                                   = "60000"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                            = "2"
          + "FUNCTIONS_WORKER_RUNTIME"                                  = "node"
          + "FederationEntityBasePath"                                  = "https://wallet.io.pagopa.it"
          + "FederationEntityContacts"                                  = "pagopaspa@pec.pagopa.it"
          + "FederationEntityHomepageUri"                               = "https://io.italia.it"
          + "FederationEntityLogoUri"                                   = "https://io.italia.it/assets/img/io-it-logo-blue.svg"
          + "FederationEntityOrganizationName"                          = "PagoPA S.p.A."
          + "FederationEntityPolicyUri"                                 = "https://io.italia.it/privacy-policy/"
          + "FederationEntityTosUri"                                    = "https://io.italia.it/privacy-policy/"
          + "GoogleAppCredentialsEncoded"                               = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=GoogleAppCredentialsEncoded)"
          + "GooglePublicKey"                                           = "LS0tLS1CRUdJTiBQVUJMSUMgS0VZLS0tLS0KTUlJQ0lqQU5CZ2txaGtpRzl3MEJBUUVGQUFPQ0FnOEFNSUlDQ2dLQ0FnRUFyN2JIZ2l1eHB3SHNLN1F1aTh4VQpGbU9yNzVndk1zZC9kVEVEREpkU1N4dGY2QW43eHlxcFJSOTBQTDJhYnhNMWRFcWxYbmYydHF3MU5lNFh3bDVqCmxSZmRuSkxtTjBwVHkvNGxqNC83dHYwU2szaWlLa3lwbkVVdFI2V2ZNZ0gwUVpmS0hNMStkaSt5OVRGUnR2NnkKLy8wcmIrVCtXOGE5bnNOTC9nZ2puYXI4NjQ2MXFPMHJPczJjWGpwM2tPRzFGRUo1TVZtRm1CR3RucktwYTczWApwWHlUcVJ4Qi9NMG4xbi9XOW5HcUM0RlNZYTA0VDZONVJJWkdCTjJ6Mk1UNUlLR2JGbGJDOFVyVzBEeFc3QVlJCm1RUWNIdEdsL20wMFFMVld1dEhRb1ZKWW5GUGxYVGNIWXZBU0x1K1JoaHNiRG14TWdKSjBtY0RwdnNDNFBqdkIKK1R4eXdFbGdTNzB2RTBYbUxEK09KdHZzQnNsSFp2UEJLQ09kVDBNUyt0Z1NPSWZnYSt6MVoxZzcrRFZhZ2Y3cQp1dm1hZzhqZlBpb3lLdnhuSy9FZ3NUVVZpMmdoenE4d20yN3VkL21JTTdBWTJxRU9SUjhHbzNUVkI0SHpXUWdwClpydDNpNU1JbENhWTUwNEx6U1JpaWdIQ3pBUGxId3MrVzByQjVOK2VyNS8ycEpLbmZCU0RpQ2lGQVZ0Q0xPWjcKZ0xpTW0wamhPMkI2dFVYSEkvK01SUGp5MDJpNTlsSU5NUlJldjU2R0t0Y2Q5cU8vMGtVSldkWlRkQTJYb1M4MgppeFB2WnRYUXBVcHVMMTJhYis5RWFESzhaNFJISllZZkNUM1E1dk5BWGFpV1ErOFBUV20yUWdCUi9ia3dTV2MrCk5wVUZnTlBOOVB2UWk4V0VnNVVtQUdNQ0F3RUFBUT09Ci0tLS0tRU5EIFBVQkxJQyBLRVktLS0tLQ=="
          + "HardwarePublicTestKey"                                     = "LS0tLS1CRUdJTiBQVUJMSUMgS0VZLS0tLS0KTUZrd0V3WUhLb1pJemowQ0FRWUlLb1pJemowREFRY0RRZ0FFMDFtMHhmNXVqUTVnMjJGdloyemJGcnZ5THg5YgpnTjJBaUxWRnRjYTJCVUh0a2dwV3Y5WUpDRElzNmxQS3hWU3NFb25QVXZPTTJVcmNNUGdwMDRZZU9nPT0KLS0tLS1FTkQgUFVCTElDIEtFWS0tLS0t"
          + "HttpRequestTimeout"                                        = "5000"
          + "IosBundleIdentifiers"                                      = "it.pagopa.app.io,it.pagopa.app.io.poc.itwallet"
          + "IosTeamIdentifier"                                         = "M2X5YQ4BJ7"
          + "MailSender"                                                = "IO - l'app dei servizi pubblici <no-reply@io.italia.it>"
          + "MailupSecret"                                              = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=MailupSecret)"
          + "MailupUsername"                                            = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=MailupUsername)"
          + "NODE_ENV"                                                  = "production"
          + "PidIssuerApiBaseURL"                                       = "https://util.wallet.ipzs.it"
          + "PidIssuerApiClientCertificate"                             = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM4RENDQWRpZ0F3SUJBZ0lVRnhWVkZnNFYzOTA3VWY0ZHVXZExURWFIQTVJd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0R6RU5NQXNHQTFVRUF3d0VjbTl2ZERBZUZ3MHlOREEzTWpNeE1EQTBNREphRncwek5EQTNNakV4TURBMApNREphTUJFeER6QU5CZ05WQkFNTUJtTnNhV1Z1ZERDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDCkFRb0NnZ0VCQUxsUHd2TTBxbTVvNGpoVHQ4cGRxYkhTR1pPbmpoejJSZG1iaVpkbmZqdm5UbCtwcVcwY1BRNHcKVk0xQkQrYllDKzVjbTVNRmRkNkt3SWM1SjBaRzJTcy9adEZpRTJKMnEvM084VDlkY0tQNHRBY0ZMcnVaTEtRbQpWZk5vZng4ZzN1cktBL01lTUhxZTR3U1RQU25iUGNPd0tYMmdsQlE2bU0vODdUdHdvd2RrWE9La1RkRGRDZlZMCjNyODhEVGNYR0ZDM2VsZlU1bSs4ZlUvVFVKMzMzMkR2MjNqRGY2ZEVPaUEwaDRBNTZob3FNLzlYQkU0OVZBNjMKakMzdlRKL0pObGFDMnlRYSs5Zno3TFRMV09WUFdNdFFhTm1XNGN4TnVJM01WZi8rWkFnOFNibWVkUG5rRjV5RApJeWlmM0pVb3F2elJjQ2JMaFg4Z0t5UU02UUxKVWI4Q0F3RUFBYU5DTUVBd0hRWURWUjBPQkJZRUZPZTJWTUE5Cll2eDBIWDYvdE1xeUkxNysxS05ZTUI4R0ExVWRJd1FZTUJhQUZGZFFmeGRsUUsvTEhzMjE4V2txQmp0c1daSWYKTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFBb1lZL2tsQW1OVDA5TFZVU0JhZ3Fla0hwVnhJMjZCSVZUUHRuagpKdExsTXd0RHgxZHA5VGNXN3A4ZHFNaVVyWm4vVm10Vm9IUU95c3IrQlNuNHRqTG1taGtJQ2Zacm05SXQxTVA5ClIzWUdOVS96dzZSTlVpSGVCRnY2Snk0emI3dk1Nck1TM2h3eXdaMk0xaUlhZVdHeitFOHdNSDk1UVkxQU8rZjYKaERNa3p1dkJIVDhOQ1lRTTNOSlFNWFh1Nkx5VHBBQU93a3VlNHhmMjBmSXpYc1g1VGFTYXJZOXZ2VHJueW43awpBRkNQREkycTZ6MUNPcHNOcVlNMld2c014Y1ZNRU4zZEFZYWVMUlAzODNyVk9Ua1pnckN0SVlPYlVUNzVTSi81CkxMOVd1Zm1XY2xMY1BLR3UzRTBaZnIxM1daR1E5eW5EaEIwb01wUnpOdWFmN2hJMAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + "PidIssuerApiClientPrivateKey"                              = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=PidIssuerApiClientPrivateKey)"
          + "PidIssuerApiRequestTimeout"                                = "10000"
          + "PidIssuerApiRootCACertificate"                             = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUhkVENDQlYyZ0F3SUJBZ0lRWERzL042MzhLUDRQejlPcitEK0ZVVEFOQmdrcWhraUc5dzBCQVFzRkFEQnIKTVFzd0NRWURWUVFHRXdKSlZERU9NQXdHQTFVRUJ3d0ZUV2xzWVc0eEl6QWhCZ05WQkFvTUdrRmpkR0ZzYVhNZwpVeTV3TGtFdUx6QXpNelU0TlRJd09UWTNNU2N3SlFZRFZRUUREQjVCWTNSaGJHbHpJRUYxZEdobGJuUnBZMkYwCmFXOXVJRkp2YjNRZ1EwRXdIaGNOTWpBd056QTJNRGN5TURVMVdoY05NekF3T1RJeU1URXlNakF5V2pDQmlURUwKTUFrR0ExVUVCaE1DU1ZReEVEQU9CZ05WQkFnTUIwSmxjbWRoYlc4eEdUQVhCZ05WQkFjTUVGQnZiblJsSUZOaApiaUJRYVdWMGNtOHhGekFWQmdOVkJBb01Ea0ZqZEdGc2FYTWdVeTV3TGtFdU1UUXdNZ1lEVlFRRERDdEJZM1JoCmJHbHpJRTl5WjJGdWFYcGhkR2x2YmlCV1lXeHBaR0YwWldRZ1UyVnlkbVZ5SUVOQklFY3pNSUlDSWpBTkJna3EKaGtpRzl3MEJBUUVGQUFPQ0FnOEFNSUlDQ2dLQ0FnRUFzNzNDaCt0Mm93bTNheVRreXF5ME9QdUNUaXlieFR5Uwo0Y1U0eTB0MlJHU3dDTmpMaC9yY3V0TzB5b3JpWnhWdFByTk1jSVJRNTQ0QlFoSEZ0L3lwVzdlK3Q4d1dLckhhCnIzQmtLd1NVYnFOd3BEV1AxYlhzN0lKVFZoSFhXR0FtN0FrMUZocnJCbXRYazhRdGR6VHpERHV4ZkZCSzdzQ0wKTjBKZHFvcWIxVjF6M3dzV3FBdnI0S2xTQ0ZXMDVOaDRiYVdtL2tYT21iOFUrWFI2a1VtdW9WdmlhM2lCaG90UgpUekFIVE85U1dXa2dqVGNpci9uaEJ2eUwyUm9xa2dZeVAvazUwYnpuYVZPR0ZuRld6ZmwwWG5yTS9zYWxmQ0JoCk8wLzF2TmFvVThlbFI2QXRiZENGQXVwZ1F5OTVHdUZJUlZTOG4vY0YwUXVwZlBqVWwra0dTTHp2R0FjKzZvTkUKYWxwQWhLSVMvK1AwdU9EelJyUzlFcTBXWDFpU2o2S0h0UU1OTjRaS3NTNG5zdXZZQ2FobkFjMFF3UXlvZHVBVwppVS95bmhVOVdUSUVlMVZJb0VERTc5TlBPSTIvODBScWJacWRwQUtVYWYwRnZ1cVZYaEVjamlKSnUrZDB3OVlOCmI3Z3VyZDZ4a2FTWGVtVy9mUDRpZEJpTmtkOGFDVkFkc2hHUVluNnloK25hMEx1NUlHODhaMmtTSUZjWER0d3kKempjeGtXODZwd2tPNkdla0VvbVZCTktjdjBDZXkyU21mOHVocFprMTVUU0NleUZEclpCV0g5T3NEc3QvVG5oegpwTjE1Nkh1dzNNM1JSZEVlZ3QzM2ZjeVB5a2d0MEhUaHhyRXY5RHdPemhzNmxDUTVSTlFKTzdadlpGMVppcWdUCkZPSjZ2czF4TXFFQ0F3RUFBYU9DQWZRd2dnSHdNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdId1lEVlIwakJCZ3cKRm9BVVV0aUlPc2lmZUdidGlmTjdPSENVeVFJQ050QXdRUVlJS3dZQkJRVUhBUUVFTlRBek1ERUdDQ3NHQVFVRgpCekFCaGlWb2RIUndPaTh2YjJOemNEQTFMbUZqZEdGc2FYTXVhWFF2VmtFdlFWVlVTQzFTVDA5VU1FVUdBMVVkCklBUStNRHd3T2dZRVZSMGdBREF5TURBR0NDc0dBUVVGQndJQkZpUm9kSFJ3Y3pvdkwzZDNkeTVoWTNSaGJHbHoKTG1sMEwyRnlaV0V0Wkc5M2JteHZZV1F3SFFZRFZSMGxCQll3RkFZSUt3WUJCUVVIQXdJR0NDc0dBUVVGQndNQgpNSUhqQmdOVkhSOEVnZHN3Z2Rnd2daYWdnWk9nZ1pDR2dZMXNaR0Z3T2k4dmJHUmhjREExTG1GamRHRnNhWE11CmFYUXZZMjRsTTJSQlkzUmhiR2x6SlRJd1FYVjBhR1Z1ZEdsallYUnBiMjRsTWpCU2IyOTBKVEl3UTBFc2J5VXoKWkVGamRHRnNhWE1sTWpCVExuQXVRUzRsTW1Zd016TTFPRFV5TURrMk55eGpKVE5rU1ZRL1kyVnlkR2xtYVdOaApkR1ZTWlhadlkyRjBhVzl1VEdsemREdGlhVzVoY25rd1BhQTdvRG1HTjJoMGRIQTZMeTlqY213d05TNWhZM1JoCmJHbHpMbWwwTDFKbGNHOXphWFJ2Y25rdlFWVlVTQzFTVDA5VUwyZGxkRXhoYzNSRFVrd3dIUVlEVlIwT0JCWUUKRkorS3NiWHhzZDZDOUNkOHZvak4zcWxEZ2FOTE1BNEdBMVVkRHdFQi93UUVBd0lCQmpBTkJna3Foa2lHOXcwQgpBUXNGQUFPQ0FnRUFKYnlnTW5LSjVNNmJ5cjVFY3RxMDVPRHF3Tk10a3k4VEVGM081NWc2UkhoeGJsZjZPZWdaCjR1aTQrRWxITk9JWGp5Y2JldVVHdUZBNExTY0NDOWZuSTFSbm44VEkyUTdPUDVZV2lmRWZucmRwOTl0L3RKelEKaGZkaTdaVGRSUlpaR1Y5eCtncmZSL1J0alQyQzNMdDlYNGxjYnVTeFRlYTNQSEF3d2kwQTNiWVJSMUw1Y2lQbQplQW5ZdEc5a3BhdDgvUnVDMjJveGlaWjVGZGpVNndyUldrQVNSTGlJd05jRklZZnZwVWJNV0VsYUNVaHFhQjJ5Cll2V0Y4bzAycG5hWWI0YnZUQ2c0Y1ZhYlZub2pVdXVYSDgxTGVRaGhzU1hMd2Nkd1NkZXcwTkw0ekNpTkNuMlEKaURacHoyYmlDV0RnZ2libVd4c1VVRjZBYnFNSG53c2RTOHZzS1hpRlFKSGVBZE5BaEEra3dwcVlBZGhVaUNkagpSVFVkdFJOVXVjTHZaRU4xT0F2Vll5b2c5eFlDZmh0a3FnWFFST01BTlArWi8reWFaYWhhUC9WZ2FrL1YwMHNlCkhkaDdGK0I2aDVIVmR3ZGgrMTdFMmpsK2FNVGZ5dkJGY2cySC85UWp5bDRUWThOVy82djBEUEs1MnNWdDhhMzUKSSs3eExHTFBvaEFsNHo2cEVmMk94Z2pNTmZYWENYUzMzc21SZ3oxZExRRm84VXBBYjNyZjg0emtYYXFFSTZRaQoyUCs1cGliVkZRaWdSYm40UmNFK0syYS9ubTJNL28rV1pUU2lvK0UrWVhhY25OazcxVmNPODJiaU9vZitqQktUCmlDM1hpN3JBbHlwbW1lK1FGQnc5RjFKODlpZzNzbVYvSGFOOHRPMGxmVHB2bTdadnpkNVRrTXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0KLS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZ1ekNDQTZPZ0F3SUJBZ0lJVndvUmwwTEU0OHd3RFFZSktvWklodmNOQVFFTEJRQXdhekVMTUFrR0ExVUUKQmhNQ1NWUXhEakFNQmdOVkJBY01CVTFwYkdGdU1TTXdJUVlEVlFRS0RCcEJZM1JoYkdseklGTXVjQzVCTGk4dwpNek0xT0RVeU1EazJOekVuTUNVR0ExVUVBd3dlUVdOMFlXeHBjeUJCZFhSb1pXNTBhV05oZEdsdmJpQlNiMjkwCklFTkJNQjRYRFRFeE1Ea3lNakV4TWpJd01sb1hEVE13TURreU1qRXhNakl3TWxvd2F6RUxNQWtHQTFVRUJoTUMKU1ZReERqQU1CZ05WQkFjTUJVMXBiR0Z1TVNNd0lRWURWUVFLREJwQlkzUmhiR2x6SUZNdWNDNUJMaTh3TXpNMQpPRFV5TURrMk56RW5NQ1VHQTFVRUF3d2VRV04wWVd4cGN5QkJkWFJvWlc1MGFXTmhkR2x2YmlCU2IyOTBJRU5CCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBcDhiRXBTbWtMTy9sR01Xd1VLTnYKVVR1ZkNsckp3a2c0Q3NJY29CaC9rYldIdVVBLzNSMW9Id2lEMVMwZWlLRDRqMWFQYlprQ2twQVcxVjhJYkluWAo0YXk4SU1LeDRJTlJpbWxOQUpaYWJ5L0FSSDZqRHVTUnpWanUzUHZISGtWSDNTZTVDQUdmcGlFZDlVRXRMMHo5CktLM2dpcTBpdEZabGpvWlVqNU5ES2Q0NVJuaWpNQ082emZCOUUxZkFYZEtEYTBoTXhLdWZnRnBiT3IzSnB5SS8KZ0Njeld3NjNpZ3hkQnpjSXkyelNla2NpUkRYRnpNd3VqdDBxN2JkOVpnMWZZVkVpVlJ2alJ1UGpQZEExWXByYgpyeFRJVzZITWlSdmhNQ2I4b0pzZmdhZEhId1Ryb3ptU0JwK1owNy9UNms5UW5Cbitsb2NlUEdYMm94Z2tnNFlRCjUxUStxRHAySkUrQkljWGpEd0w0azVSSElMdisxQTdUYUxuZHhIcUVndU5UVkhuZDI1elM4Z2ViTHJhOFB1MkYKYmU4bEVmS1hHa0poOTBxWDZJdXhFQWY2WllHeW9qblA5enovR1B2RzhWcUxXZUlDckh1UzBFNFVUMWxGOWd4ZQpLRit3NkQ5Rno4K3ZtMi83aE5OM1dwVnZySlNFbnU2OHdFcVBTcFA0UkNIaU1VVmhVRTRRMk9NMWZFd1p0TjRGCnY2TUduOGkxemVRZjF4Y0dEWHFWZEZVTmFCcjhFQnRpWkoxdDRKV2d3NVFIVncwVTVyMEYrN2lmNXQrTDRzYm4KZnBiMlU4V0FORkFvV1BBU1VIRVhNTHJtZUdPODlMS3RteXV5L3VFNWpGNjZDeUNVM251RHVQL2pWbzIzRWVrNwpqUEt4d1YyZHBBdE1LOW15R1BXMW4wc0NBd0VBQWFOak1HRXdIUVlEVlIwT0JCWUVGRkxZaURySW4zaG03WW56CmV6aHdsTWtDQWpiUU1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0h3WURWUjBqQkJnd0ZvQVVVdGlJT3NpZmVHYnQKaWZON09IQ1V5UUlDTnRBd0RnWURWUjBQQVFIL0JBUURBZ0VHTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElDQVFBTAplM0tId0dDbVNVeUlXT1lkaVBjVVpFaW0yRmdLRGs4VE5kODFIZFR0QmpISWdUNXExZDA3R2pMdWtEMFIwaTcwCmpzTmpMaU5tc0dlK2I3YkFFemxncXFJMEpaTjFVdDZubmEwT2g0bFNjV29XUEJrZGcvaWFLV1crOUQrYTJmRHoKV29jaGNZQk55K0E0bXorNyt1QXdUYytHMDJVUUdSalJsd0t4SzNKQ2FLeWd2VTVhMmhpL2E1aUIwUDJhdmw0VgpTTTBSRmJuQUtWeTA2SWozUGphdXQyTDlIbUxlY0hnUUhFaGIycnlrT0xwbjdWVStYbGZmMUFOQVRJR2swazlqCnB3bENDUlQ4QUtuQ2dITlBMc0JBMlJGN1NPcDZBc0RUNnlnQkpsaDB3Y0J6SW0yVGxmMDVmYnNxNC9hQzR5eVgKWDA0ZmtaVDYvaXlqMkhZYXVFMnlPRStiK2gxSVlIa200dlA5cWRDYTZIQ1BTWHJXNWIwS0R0c3Q4NDIvNitPawpmY3ZIbFhIbzJxTjh4Y0w0ZEpJRUc0YXNwQ0pUUUxhcy9reDJ6L3VVTXNBMW4zWS9idVdRYnFDbUpxSzRMTDdSCks0WDlwMmpJdWdFcnNXeDBIYmh6bGVmdXQ4Y2w4QUJNQUxKK3RndUxIUFBBVUo0bHVlQUkzalptL3plbDBidFUKWkN6Sko3VkxrbjVsLzlNdDRibE92SCtrUVNHUVFYZW1PUi9xbnVPZjBHWnZCZXlxZG42L2F4YWc2N1hIL0pKVQpMeXNSSnlVM2VFeFJhckR6ekZoZEZQRnFTQlgvd2dlMnNZMFBqbHhRUnJNOXZ3R1lUN0paVkVjK05IdDRiVmFUCkxuUHFaaWg0elIwVXY2Q1BMeTY0TG83eUZJck02YlY4KzJ5ZERLWGhsZz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          + "PidIssuerHealthCheckEnabled"                               = "false"
          + "SLOT_TASK_HUBNAME"                                         = "StagingTaskHub"
          + "SlackStatusChannelWebhook"                                 = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=SlackStatusChannelWebhook)"
          + "StorageConnectionString"                                   = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=StorageConnectionString)"
          + "TrialSystemApiKey"                                         = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=TrialSystemApiKey)"
          + "ValidateWalletInstanceCertificatesQueueName"               = "wallet-instances-revocation-check-02"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"           = "1"
          + "WEBSITE_DNS_SERVER"                                        = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                                  = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                             = "/api/v1/wallet/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                         = "200"
          + "WEBSITE_WARMUP_PATH"                                       = "/api/v1/wallet/health"
          + "WalletAttestationWalletLink"                               = "https://wallet.io.pagopa.it"
          + "WalletAttestationWalletName"                               = "IT Wallet"
          + "WalletInstanceCreationEmailQueueName"                      = "wallet-instance-creation-email-queue-01"
          + "WalletInstanceRevocationEmailQueueName"                    = "wallet-instance-revocation-email-queue-01"
          + "WalletKeys"                                                = "@Microsoft.KeyVault(VaultName=io-p-itn-wallet-kv-01;SecretName=WalletKeys)"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + function_app_id                                = (known after apply)
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitnwalletprestfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/v1/wallet/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_monitor_metric_alert.function_app_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      + auto_mitigate            = false
      + description              = "Function availability is under threshold level. Runbook: -"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-wallet-pre-func-01] Health Check Failed"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "HealthCheckStatus"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 50
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnwalletprestfn01] Low Availability"
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-wallet-pre-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-wallet-pre-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_private_endpoint.st_blob will be created
  + resource "azurerm_private_endpoint" "st_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-wallet-pre-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-wallet-pre-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-wallet-pre-file-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-wallet-pre-file-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-wallet-pre-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-wallet-pre-queue-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_private_endpoint.staging_function_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-wallet-pre-staging-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-wallet-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-wallet-pre-staging-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.staging_function_storage_account_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-p-itn-wallet-pre-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-p-itn-wallet-rg-01"
      + sku_name                     = "P1v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.function_apps.module.function_app_user_pre.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnwalletprestfn01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-wallet-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "ModuleName"     = "azure_function_app"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.3.1"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass             = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action     = "Deny"
      + id                 = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.function_apps.module.function_app_user_pre.azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.12.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-wallet-pre-func-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 19 to add, 1 to change, 0 to destroy.

```
</details>
